In [6]:
import pandas as pd
d=pd.read_csv('data.csv')
d

  Name  Class  Roll NO
0    A      1     19.0
1    B      2      NaN
2    C      3      NaN
3    D      4     90.0

In [7]:
d.dropna()

  Name  Class  Roll NO
0    A      1     19.0
3    D      4     90.0

In [11]:
d.drop(d.iloc[:,1:2],inplace=True, axis=1)

In [12]:
d

  Name
0    A
1    B
2    C
3    D

In [13]:
d.drop

<bound method DataFrame.drop of   Name
0    A
1    B
2    C
3    D>

In [14]:
d

  Name
0    A
1    B
2    C
3    D

In [16]:
d=pd.read_csv('data.csv')
d

  Name  Class  Roll NO
0    A      1     19.0
1    B      2      NaN
2    C      3      NaN
3    D      4     90.0

In [17]:
d.drop([1],axis=0)

  Name  Class  Roll NO
0    A      1     19.0
2    C      3      NaN
3    D      4     90.0

In [20]:
import numpy as np
d=pd.read_csv('data.csv')
d.replace(to_replace=[90],value=0)

  Name  Class  Roll NO
0    A      1     19.0
1    B      2      NaN
2    C      3      NaN
3    D      4      0.0

In [21]:
d=pd.read_csv('data.csv')
d.replace(to_replace=np.NaN,value=0)

  Name  Class  Roll NO
0    A      1     19.0
1    B      2      0.0
2    C      3      0.0
3    D      4     90.0

In [23]:
d=pd.read_csv('data.csv')
d.drop(['Name'],axis=1)

   Class  Roll NO
0      1     19.0
1      2      NaN
2      3      NaN
3      4     90.0

In [27]:
a=d.dropna(how='all')

In [28]:
a

  Name  Class  Roll NO
0    A      1     19.0
1    B      2      NaN
2    C      3      NaN
3    D      4     90.0

In [29]:
a=d.dropna(how='any')

In [30]:
a

  Name  Class  Roll NO
0    A      1     19.0
3    D      4     90.0